// 基于准备好的dom，初始化echarts实例
var myChart = echarts.init(document.getElementById('main'), 'dark');

// 指定图表的配置项和数据
var option = {
    legend: {},
    tooltip: {},
    dataset: {
        // 提供一份数据。
        source: [
            ['大组', '低级别', '高级别'],
            ['万宝晶', 0.0, 0.0],
       ['李睿子', 0.0, 0.0],
       ['赵天赐', 0.0, 0.0],
       ['生峻玮', 0.0, 2.0],
       ['王妍', 0.0, 0.0],
       ['孙德良', 0.0, 0.0],
       ['李旭烊', 0.0, 0.0],
       ['张遇时', 0.0, 0.0],
       ['张琪', 0.0, 0.0],
       ['张春秋', 0.0, 14.0],
       ['徐嘉祺', 0.0, 0.0],
       ['刘春苗', 0.0, 0.0],
       ['孙骏', 0.0, 0.0],
       ['郝泉伏', 1.0, 9.0],
       ['崔莹莹', 2.0, 2.0],
       ['王家兴', 2.0, 12.0],
       ['赵凯', 3.0, 10.0],
       ['张浩晨', 5.0, 18.0],
       ['葛丽颖', 5.0, 0.0],
       ['朱旖旎', 6.0, 38.0],
       ['杨妮妮', 6.0, 3.0],
       ['石慧明', 7.0, 4.0],
       ['林芳', 7.0, 2.0],
       ['王明哲', 8.0, 2.0],
       ['王世强', 9.0, 56.0],
       ['毕金玲', 9.0, 41.0],
       ['宋雯璐', 10.0, 14.0],
       ['贾佳', 10.0, 63.0],
       ['卢侠', 12.0, 42.0],
       ['李璐诗', 13.0, 51.0],
       ['王尉', 18.0, 13.0],
       ['李轶', 19.0, 61.0],
       ['马蓓娜', 40.0, 2.0],
       ['赵宛亦', 40.0, 7.0],
       ['姜昊男', 47.0, 1.0],
       ['何永', 51.0, 4.0],
       ['段冶', 61.0, 19.0],
       ['张煜楷', 64.0, 5.0],
       ['王天骄', 87.0, 3.0],
       ['王传奇', 92.0, 5.0],
       ['郭坤', 108.0, 14.0],
       ['鞠姝娴', 129.0, 14.0],
       ['郑吉成', 140.0, 16.0],
       ['孙龙翔', 156.0, 16.0],
       ['谭晨', 160.0, 14.0],
       ['邓月', 182.0, 122.0],
       ['张宗洋', 190.0, 137.0],
       ['王苏芮', 246.0, 136.0]
        ]
    },
    // 声明一个 X 轴，类目轴（category）。默认情况下，类目轴对应到 dataset 第一列。
    xAxis: {type: 'category'},
    // 声明一个 Y 轴，数值轴。
    yAxis: {},
    // 声明多个 bar 系列，默认情况下，每个系列会自动对应到 dataset 的每一列。
    series: [
        {type: 'bar'},
        {type: 'bar'},
    ],
    dataZoom: [{
        //用来控制x轴的缩放和选取
        type: 'slider', // 这个 dataZoom 组件是 slider 型 dataZoom 组件
        start: 10,      // 左边在 10% 的位置。
        end: 60         // 右边在 60% 的位置。
    },],
};

// 使用刚指定的配置项和数据显示图表。
myChart.setOption(option);